spec/fixtures/stripe_webhooks/customer.subscription.updated.json

{
  "created": 1433958862,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2015-02-18",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "plan": {
        "interval": "month",
        "name": "LearnSignal Personal",
        "created": 1433353802,
        "amount": 999,
        "currency": "eur",
        "id": "development-41O2JywQSud5BJguzDfw_00000000000000",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": 7,
        "metadata": {},
        "statement_descriptor": "LearnSignal"
      },
      "object": "subscription",
      "start": 1433353841,
      "status": "active",
      "customer": "cus_00000000000000",
      "cancel_at_period_end": false,
      "current_period_start": 1433958641,
      "current_period_end": 1436550641,
      "ended_at": null,
      "trial_start": 1433353841,
      "trial_end": 1433958641,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null,
      "discount": null,
      "tax_percent": null,
      "metadata": {}
    },
    "previous_attributes": {
      "status": "trialing",
      "current_period_start": 1433353841,
      "current_period_end": 1433958641
    }
  }
}
